<?php
$data = array(
  '特住' => 
    array('0', '7,000', '東京都東京市東町1-1-1'),
  '歴住' => 
    array('2,000,000', '7,000', '東京都東京市東町1-1-1'),
  '再住' => 
    array('1,000,000', '4,000', '東京都東京市東町1-1-1'),
  '前住' => 
    array('500,000', '2,500', '東京都東京市東町1-1-1'),
  '住持' => 
    array('250,000', '2,000', '東京都東京市東町1-1-1'),
  '東堂' => 
    array('100,000', '1,200', '東京都東京市東町1-1-1'),
  '西堂' => 
    array('70,000', '1,000', '東京都東京市東町1-1-1'),
  '塔司' => 
    array('50,000', '800', '東京都東京市東町1-1-1'),
  '座元' => 
    array('30,000', '600', '東京都東京市東町1-1-1'),
  '首座' => 
    array('10,000', '400', '東京都東京市東町1-1-1'),
  '蔵主' => 
    array('5,000', '300', '東京都東京市東町1-1-1'),
  '侍者' => 
    array('2,000', '200', '東京都東京市東町1-1-1'),
  '沙弥' => 
    array('1,000', '200', '東京都東京市東町1-1-1'),
);

?>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8" />
<title>PHP入門教室</title>
</head>
<body>
名簿には<?php print(count($data)); ?>人が登録されています。
<ol>
<?php
foreach($data as $name => $address) {
  print('<dt>'.$name.'</dt>');
  print('<dd>'.$address[0].'</dd>');
  print('<dd>'.$address[1].'</dd>');
}
?>
</ol>
</body>
</html>
